In [1]:
import pandas as pd

In [2]:
#in this we will study about series which is similar to list and data frames

In [7]:
s=pd.Series(['john','rich','michael','sue','james'])
print(s)
print(s[0])
print(s[1:4])
print(s[[0,1,4]])
param=s!='john'
print([s[param]])

0       john
1       rich
2    michael
3        sue
4      james
dtype: object
john
1       rich
2    michael
3        sue
dtype: object
0     john
1     rich
4    james
dtype: object
[1       rich
2    michael
3        sue
4      james
dtype: object]

In [15]:
d = {'New york':1300,
   'Chicago':900,
   'San francisco':1100,
   'Austin':450}
cities=pd.Series(d)
print(cities)
cities[['Austin','Chicago']]

New york         1300
Chicago           900
San francisco    1100
Austin            450
dtype: int64

Austin     450
Chicago    900
dtype: int64

In [16]:
cities[cities<1000]

Chicago    900
Austin     450
dtype: int64

In [18]:
cities[cities<2000]=750
print(cities)

New york         750
Chicago          750
San francisco    750
Austin           750
dtype: int64

In [22]:
#dataframe is tabular datastructure having rows nd column similiar to spreadsheet and it has collection of series
titanic=pd.read_csv('titanic.txt', sep='\t')
print(titanic.head())

  pclass    age   sex survived
0    1st  adult  male      yes
1    1st  adult  male      yes
2    1st  adult  male      yes
3    1st  adult  male      yes
4    1st  adult  male      yes

In [23]:
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
        ...
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

In [24]:
titanic['sex']

0         male
1         male
2         male
3         male
4         male
         ...
2196    female
2197    female
2198    female
2199    female
2200    female
Name: sex, Length: 2201, dtype: object

In [25]:
titanic[['age','pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
...     ...    ...
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

In [26]:
titanic[(titanic.age=='child')&(titanic.pclass=='2nd')]

    pclass    age     sex survived
586    2nd  child    male      yes
587    2nd  child    male      yes
588    2nd  child    male      yes
589    2nd  child    male      yes
590    2nd  child    male      yes
591    2nd  child    male      yes
592    2nd  child    male      yes
593    2nd  child    male      yes
594    2nd  child    male      yes
595    2nd  child    male      yes
596    2nd  child    male      yes
597    2nd  child  female      yes
598    2nd  child  female      yes
599    2nd  child  female      yes
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

In [27]:
titanic[320:330]

    pclass    age     sex survived
320    1st  child    male      yes
321    1st  child    male      yes
322    1st  child    male      yes
323    1st  child    male      yes
324    1st  child  female      yes
325    2nd  adult    male      yes
326    2nd  adult    male      yes
327    2nd  adult    male      yes
328    2nd  adult    male      yes
329    2nd  adult    male      yes

In [29]:
by_age=titanic.groupby('age')
by_age.size()

age
adult    2092
child     109
dtype: int64

In [32]:
print(titanic.groupby(['survived','sex']).size())

survived  sex
no        female     126
          male      1364
yes       female     344
          male       367
dtype: int64